import React from "react";

const Question = () => {
  return (
    <div>
      <h1>Question</h1>
      <p>
        useState() হল একটি বিল্ট-ইন রিঅ্যাক্ট হুক যা আপনাকে কার্যকরী
        উপাদানগুলিতে স্টেট ভেরিয়েবল রাখার অনুমতি দেয়। এটি ব্যবহার করা উচিত যখন
        DOM-এ এমন কিছু থাকে যা গতিশীলভাবে ম্যানিপুলেট/নিয়ন্ত্রণ করে। নীচে
        দেওয়া উদাহরণ কোডে, useState(0) একটি টিপল ফেরত দেবে যেখানে গণনা হল প্রথম
        প্যারামিটার যা কাউন্টারের বর্তমান অবস্থার প্রতিনিধিত্ব করে এবং দ্বিতীয়
        প্যারামিটার সেট কাউন্টার পদ্ধতিটি আমাদের কাউন্টারের অবস্থা আপডেট করার
        অনুমতি দেবে।
      </p>
    </div>
  );
};

export default Question;
