import React from "react";

const Question = () => {
  return (
    <div>
      <h1>Question</h1>
      <h3>How useState work</h3>
      <p>
        useState() হল একটি বিল্ট-ইন রিঅ্যাক্ট হুক যা কার্যকরী
        উপাদানগুলিতে স্টেট ভেরিয়েবল রাখার অনুমতি দেয়। এটি ব্যবহার করা উচিত যখন
        DOM-এ এমন কিছু থাকে যা গতিশীলভাবে নিয়ন্ত্রণ করে। useState(0) একটি টিপল ফেরত দেবে যেখানে গণনা হল প্রথম
        প্যারামিটার যা কাউন্টারের বর্তমান অবস্থার প্রতিনিধিত্ব করে এবং দ্বিতীয়
        প্যারামিটার সেট কাউন্টার পদ্ধতিটি আমাদের কাউন্টারের অবস্থা আপডেট করার
        অনুমতি দেবে।
      </p>
      <h3>props vs state</h3>
      <p>রাজ্য হল কম্পোনেন্টের স্থানীয় অবস্থা যা কম্পোনেন্টের বাইরে অ্যাক্সেস এবং পরিবর্তন করা যায় না। এটি একটি ফাংশনে স্থানীয় ভেরিয়েবলের সমতুল্য। অন্যদিকে, প্রপস, উপাদানগুলিকে প্রপ আকারে তাদের মূল উপাদান থেকে ডেটা গ্রহণ করার ক্ষমতা দিয়ে উপাদানগুলিকে পুনরায় ব্যবহারযোগ্য করে তোলে।</p>
    </div>
  );
};

export default Question;
